def return_title():
    return [
        'uid', '姓名', '性别', '年龄', '婚姻状况', '地址', '手机', '逾期天数', '剩余期数', '套餐',
        '查询批次号', '单位名称', '分支机构', '操作员登录名', '请求数量', '申请查询时间', '被查询者姓名',
        '证件号码', '身份认证-结果(1.一致,2.不一致)', '姓名核查结果', '证件号码核查结果', '手机号码核查结果',
        '运营商', '号码归属地', '风险评分', '风险建议', '风险等级', '风险综述信息-命中类型', '风险综述信息-高危人员(1是,2否)',
        '反欺诈风险综述信息-运营商', '反欺诈风险综述信息-运营商名称', '反欺诈风险综述信息-手机号码', '反欺诈风险综述信息-手机状态',
        '手机状态', '手机号码在网时长', '网贷逾期总笔数', '个人近两年被查询总次数', '风险概要信息总条数', '风险评分',
        '反欺诈风险评分信息-风险建议', '反欺诈风险评分信息-风险等级', '反欺诈风险评分信息-命中类型', '号码归属地',
        '手机状态', '在网时长', '最近一次销号时间', '运营商', '是否高危人群,1是2否', '近三年信贷逾期信息',
        '逾期天数区间', '逾期天数区间的笔数', '逾期本金', '逾期天数区间', '逾期天数区间的总笔数',
        '风险概述总条数', '司法案例信息条数', '司法执行信息条数', '司法失信信息条数', '税务行政执法信息条数',
        '催欠公告信息条数', '网贷逾期信息条数', '记录编号', '标题', '案件类型', '审结年份', '当事人类型',
        '记录编号', '司法执行概要信息-标题', '执行标的', '立案日期', '记录编号', '标题', '立案日期', '发布日期',
        '记录编号', '标题', '公告日期', '催欠公告概要信息-记录编号', '催欠公告概要信息-标题', '催欠公告概要信息-发布日期',
        '网贷逾期概要信息-记录编号', '网贷逾期概要信息-标题', '网贷逾期概要信息-发布日期', '单位类型名称',
        '近1个月查询记录数', '近3个月查询记录数', '近6个月查询记录数', '近12个月查询记录数', '近18个月查询记录数',
        '近24个月查询记录数', '近1个月各单位类型查询记录总数', '近3个月各单位类型查询记录总数', '近6个月各单位类型查询记录总数',
        '近12个月各单位类型查询记录总数', '近18个月各单位类型查询记录总数', '近24个月各单位类型查询记录总数',
        '车辆信息根节点信息-查询批次号', '查询单位名称', '分支机构名称', '查询操作员登录名', '查询请求数量',
        '查询申请时间', '车辆-姓名核查结果', '车辆-证件号码核查结果', '车辆-车牌号码核查结果', '车辆-号牌种类核查结果',
        '车辆-车辆状态信息', '车辆-厂家', '车辆-品牌', '车辆-车系', '车辆-车型', '车辆-销售名称',
        '车辆-年款', '车辆-上市年份', '车辆-车辆类别', '车辆-车辆级别', '车辆-新车指导价格', '车辆-生产状态',
        '车辆-国别', '车辆-产地类别', '车辆-排放标准', '车辆-排量（升)', '车辆-工信部综合油耗', '车辆-变速箱类型',
        '车辆-车架号核查结果', '车辆-初次登记日期核查结果',
        'st_tongdun_risk数据', 'st_tongdun_main数据', 'st_tongdun_vice_platform数据',
        'st_tongdun_vice_fuzzy数据', 'st_tongdun_vice_fuzzy_content数据',
        'st_tongdun_vice_frequency数据', 'st_tongdun_vice_follow数据'
    ]


def add_title(worksheet, col, row):
    for i in return_title():
        worksheet.write(col, row, i)
        row += 1
